/* მოგესალმებით მეგობრებო ეს არის დავალება ნომერი 2. დავალების ყველა ეტაპი აღწერილია კომენტარის სახით
 * 1) შედარება
 * 3) If პირობები
 * 4) ლოგიკური ოპერატორები
 * 5) Switch 
 */



// <------- შედარება ---------#### //

const num1 = 0;
const boolean1 = false;
const num2 = 5;
const emptyString = "";
const boolean2 = false;
const text = "I'm Text";
const text2 = "0";

// ჩამოწერეთ ცვლადები რომელი არის true რომელი false
// ჩამოწერეთ ზეპირად!
// მაგ. [1, 2, 3, 4]

// >>> კოდი დაწერეთ აქ 

const isFalse = [boolean1, boolean2];
const isTrue = [num1, num2, emptyString, text, text2];

//


// შეცვალეთ ერთი ასო რომ მიიღოთ ჭეშმარიტი დებულება
// მოკლედ ახსენით მუშაობის პრინციპი თუ რატომ იმოქმედა

console.log("abc" > "ab")
console.log(4 === 004)
// ჩემი კომანტარი: მუშაობს რადგან პირველში სტრინგები ერთმანეთშ ანბანში რიგითობის მიხედვით 
// შეედარება ხოლო მეორეში რიცხვი სტრინგს არ უდრის ამიტომაც მოვუშალე პრჭყალები



// <------- ლოგიკური ოპერატორები ---------#### //

// შეამოწმეთ სრულ წლოვნებაზე და თუ მეტი ან ტოლია
// 18 წელზე შესთავაზეთ სასმელი

// >>> კოდი დაწერეთ აქ 
// let visitor = Number(prompt("შეიყვანეთ თქვენი წლოვანება"))
// if(visitor<18) {
//   console.log("შენთვის არ შეიძლება")
// }
// else if(visitor>=18){
//   console.log("ინებეთ სასმელი")
// }else{
//   alert("ძამი მისმინე, ასაკი იწერება ციფრებში")
// }


//


// მოიფიქრეთ 2 if else-ის მაგალითი თქვენით

// >>> კოდი დაწერეთ აქ
// let xomagi = prompt("რა გიქნეს?")
// if (xomagi == "დამაჰიკონეს") {
//   console.log("მალაციი გცოდნია")
// }else {
//   console.log("დაააისგიქნეს?")
// }
///////////////////
// let giaJajanidze = prompt("ნოკია ტელეფონი ხო არ გირეკავთ?")
// if (giaJajanidze =="კი") {
//   console.log("მოწვეული ხართ შოუში გია ჯაჯანიძესთან")
// }else{
//   console.log("ეე არ იცი რაა")
// }

//


// გადაიყვანეთ If ternary operator-ში მაგ. (true ? 1 : 2) 

// >>> კოდი დაწერეთ აქ
// xomagi=="დამაჰიკონეს" ? console.log("მალაციი გცოდნია") : console.log("დაააისგიქნეს?")
// giaJajanidze=="კი" ? console.log("მოწვეული ხართ შოუში გია ჯაჯანიძესთან") : console.log("ეე არ იცი რაა")
// //



/*
  ჩვენ გვაქვს ოთხი ფერი რომელთაც აქვთ
  კონკრეტული ციფრები მინიჭებული (თეთრი=4, 
  წითელი=3, მწვანე=2, ლურჯი=1, შავი=0, 
  სხვა ყველა ფერი=undefinde)
*/

let colorId = 1

// დაწერეთ if ისე, რომ როდესაც ჩვენ
// შევცვლით მაღლა განსაზღვრულ ცვლადს გავიგოთ
// ამ აიდის ფერი (ფერი გამოიტანეთ კონსოლში ტექსტის
// სახით)


// >>> კოდი დაწერეთ აქ
// if (colorId==3) {
//   console.log("წითელი")
// }
// else if (colorId==1) {
//   console.log("ლურჯი")
// }
// else if (colorId==2) {
//   console.log("მწვანე")
// }
// else if (colorId==4) {
//   console.log("თეთრი")
// }
// else if (colorId==0) {
//   console.log("შავი")
// }else{
//   console.log("undefinde")
// }

//



// გადაიყვანეთ If ternary operator-ში მაგ. (true ? 1 : 2) 

// >>> კოდი დაწერეთ აქ
// colorId==0 ? console.log("შავი") : false;
// colorId==4 ? console.log("თეთრი") : false;
// colorId==1 ? console.log("ლურჯი") : false;
// colorId==2 ? console.log("მწვანე") : false;
// colorId==3 ? console.log("წითელი") : false;



//


// <------- დავალება Switch ---------#### //

// ცადეთ იგივე გააკეთოთ რაც წინა დავალებაში
// ოღონდ ამჯერად Switch-ის დახმარებით


// >>> კოდი დაწერეთ აქ
// switch (colorId){
//   case 0:
//     console.log("შავი")
//     break;
//   case 1:
//     console.log("ლურჯი")
//     break
//   case 2:
//     console.log("მწვანე") 
//     break
//   case 3:
//     console.log("წითელი")
//     break
//   case 4:
//     console.log("თეთრი")
//     break       
//   default:
//     console.log("1-დან 5-მდე დაწერე")

// }

//



//  ||
//  ||
//  ||
// \  /
//  \/

/*
    ეს დავალება რომ ნახოთ გამოიყენეთ HTML,
    ჩვენი მიზანია ავაწყოთ ჩეთ ბოტი რომელთანაც ვისაუბრებთ
    როგორც ხედავთ დაბლა გამზადებული მაქვს კოდის გარკვეული
    ნაწილი ეს არის ფუნქცია რომელსაც მომავალში გავივლით
    კონკრეტულად ეს ფუნქცია არის რეკურსიული, რეკურსია
    არის პროცესი როდესაც ფუნქცია თავის თავს იძახებს ჩვენ კი
    იმიტომ ვიყენებთ ამას, რომ ყოველ ჯერზე როდესად რაღაცის თქმა
    დაგვჭირდება მზად იყოს სასაუბროდ ჩვენი ბოტი

    // კოდში მოათავსეთ Switch რომლითაც დააპროგნოზებთ სასაუბრო
    // სიტყვებს ააწყობთ მინი ჩათ ბოტს.
    მაგ. 
    """"
      case "გამარჯობა":
        alert("გამარჯობა");
        break;
    """"
*/
const bot = document.getElementById("bot")


function myFun() {
  let x = prompt("მე მზად არ ვარ პასუხისათვის")

  // >>> კოდი დაწერეთ აქ გამოიყენეთ Switch
switch (x) {
  case "გამარჯობა":
    alert("გაგიმარჯოს")
    break
  case "რა გქვია?":
    alert("ჯემალი")
    break
  case "რამდენი წლის ხარ, ჯემალ?":
    alert("19 წელია რაც შემქნმეს")
    break
  case "ჯემალ ცალი თვალი სად დაკარგეთ?":
    alert("ჩხუბის დროს დამიფსეს თვალი")
    break
  case "სად არის შენი პატრონი":
    alert("რავი რო მოვა გეტყვი")
    break
  case "შე ბოტო":
    alert("კიდე დამიძახებ მაგას და...")
    break
  default:
    alert("ნორმალური კითხვა დასვი")
    break
}

  //

  // რეკურსიული ფუნქცია

}